In [11]:
import pandas as pd
series1 = pd.Series(["shyam","basha"]) 
print(series1)

0    shyam
1    basha
dtype: object

In [2]:
import pandas as pd
country=pd.Series(['newdelhi','washington','london','paris'],index=['india','usa','uk','france'])
print(country)

india       newdelhi
usa       washington
uk            london
france         paris
dtype: object

In [4]:
country.name="capitals"# table name
print(country)

india       newdelhi
usa       washington
uk            london
france         paris
Name: capitals, dtype: object

In [5]:
country.index.name="countries"
print(country)

countries
india       newdelhi
usa       washington
uk            london
france         paris
Name: capitals, dtype: object

In [10]:
#methods in pandas
import numpy as np
series=pd.Series(np.arange( 10, 20, 1 ))
print(series)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [11]:
series.head()#default top 5

0    10
1    11
2    12
3    13
4    14
dtype: int32

In [12]:
series.count()

10

In [13]:
series.tail()

5    15
6    16
7    17
8    18
9    19
dtype: int32

In [30]:
#mathematical operations
seri=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
serie=pd.Series([10,20,-10,-50,100],index=['z','y','a','c','e'])
seri+serie

a     -9.0
b      NaN
c    -47.0
d      NaN
e    105.0
y      NaN
z      NaN
dtype: float64

In [32]:
#replacing null value
seri.add(serie,fill_value=0)

a     -9.0
b      2.0
c    -47.0
d      4.0
e    105.0
y     20.0
z     10.0
dtype: float64

In [23]:
#creating dataframe using arrays
import numpy as np
import pandas as pd
array1=np.array(["assam",78438,2797])
array2=np.array(["delhi",1483,673])

df=pd.DataFrame([array1,array2],index=[1,2],columns=["states","a","b"])
print(df)

  states      a     b
1  assam  78438  2797
2  delhi   1483   673

In [25]:
#creating data frame using list of dictionaries
dictl1=[{"a":10,"b":20},{"a":5,"b":10}]
df=pd.DataFrame(dictl1)
df

    a   b
0  10  20
1   5  10

In [26]:
#creating data frame using dictinarie
data={"state":["assam","delhi","kerala"],"a":[4394,543,343],"b":[34,34,34]}
df=pd.DataFrame(data)
df

    state     a   b
0   assam  4394  34
1   delhi   543  34
2  kerala   343  34

In [29]:
#creation of dataframe using series
series1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
series2=pd.Series([100,200,300,400,500],index=['a','b','c','d','e'])
df=pd.DataFrame([series1,series2])
df

     a    b    c    d    e
0    1    2    3    4    5
1  100  200  300  400  500

In [3]:
#adding new column to dataftame
data={"state":["assam","delhi","kerala"],"a":[4394,543,343],"b":[34,34,34]}
df=pd.DataFrame(data)
df["c"]=[20,30,30]
df

    state     a   b   c
0   assam  4394  34  20
1   delhi   543  34  30
2  kerala   343  34  30

In [47]:
data={"state":["assam","delhi","kerala"],"a":[4394,543,343],"b":[34,34,34]}
df=pd.DataFrame(data)
df

    state     a   b
0   assam  4394  34
1   delhi   543  34
2  kerala   343  34

In [48]:
df.loc['4']=["sdfa",34,34]

In [49]:
df

    state     a   b
0   assam  4394  34
1   delhi   543  34
2  kerala   343  34
4    sdfa    34  34

In [64]:
#deleting rows or column
data={"state":["assam","delhi","kerala"],"a":[4394,543,343],"b":[34,34,34]}
df=pd.DataFrame(data)
d=df.drop(1,axis=0)
d

    state     a   b
0   assam  4394  34
2  kerala   343  34

In [65]:
#deleting rows
d=df.drop("b",axis=1)
d

    state     a
0   assam  4394
1   delhi   543
2  kerala   343

In [68]:
data={"state":["assam","delhi","kerala"],"a":[4394,543,343],"b":[34,34,34]}
df=pd.DataFrame(data)
d=df.rename({0:"10"})
d

     state     a   b
10   assam  4394  34
1    delhi   543  34
2   kerala   343  34

In [71]:
data={"state":["assam","delhi","kerala"],"a":[4394,543,343],"b":[34,34,34]}
df=pd.DataFrame(data)
d=df.rename({"a":"x"},axis='columns')
d

    state     x   b
0   assam  4394  34
1   delhi   543  34
2  kerala   343  34

In [4]:
#23 page end 26/7/22
#accessing elements
#label based indexing
import pandas as pd
data={"state":["assam","delhi","kerala"],"a":[4394,543,343],"b":[34,34,34]}
df=pd.DataFrame(data)
df.loc[0]

state    assam
a         4394
b           34
Name: 0, dtype: object

In [8]:
df.loc[:,"b"]

0    34
1    34
2    34
Name: b, dtype: int64

In [9]:
#boolean indexing
df.loc[:,"b"]>23

0    True
1    True
2    True
Name: b, dtype: bool

In [1]:
ResultDF.loc['Maths': 'Science', ‘Arnab’:’Samridhi’]
 
#output
    Arnab Ramit Samridhi
Maths 90 92 89
Science 91 81 91

SyntaxError: invalid character '‘' (U+2018) (Temp/ipykernel_3504/3336048431.py, line 1)

In [32]:
import pandas as pd
data={"state":["assam","delhi","kerala"],"a":[4394,543,343],"b":[34,34,34]}
df=pd.DataFrame(data)

dg=df.loc[df["state"]=="delhi"]
print(dg)
dg["a"].count()

   state    a   b
1  delhi  543  34

1

In [35]:
data={"state":["assam","delhi","kerala"],"a":[4394,543,343],"b":[34,34,34]}
df=pd.DataFrame(data)
df[["state","a"]]

    state     a
0   assam  4394
1   delhi   543
2  kerala   343